4/code/param/run_3_1000_050_01/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

vertices
(
    (0 0 -0.1)
    (0.25 0 -0.1)
    (0.75 0 -0.1)
    (1.0 0 -0.1)
    (1.0 1.0 -0.1)
    (0.75 1.0 -0.1)
    (0.75 1.1 -0.1)
    (1.0 1.1 -0.1)
    (1.0 1.2 -0.1)
    (0.75 1.2 -0.1)
    (0.25 1.2 -0.1)
    (0 1.2 -0.1)
    (0 1.1 -0.1)
    (0.25 1.1 -0.1)
    (0.25 1.0 -0.1)
    (0 1.0 -0.1)
    (0 0 0.1)
    (0.25 0 0.1)
    (0.75 0 0.1)
    (1.0 0 0.1)
    (1.0 1.0 0.1)
    (0.75 1.0 0.1)
    (0.75 1.1 0.1)
    (1.0 1.1 0.1)
    (1.0 1.2 0.1)
    (0.75 1.2 0.1)
    (0.25 1.2 0.1)
    (0 1.2 0.1)
    (0 1.1 0.1)
    (0.25 1.1 0.1)
    (0.25 1.0 0.1)
    (0 1.0 0.1)
);

blocks
(
    hex (0 1 14 15 16 17 30 31) (15 60 1) simpleGrading (1 1 1)
    hex (2 3 4 5 18 19 20 21) (15 60 1) simpleGrading (1 1 1)
    hex (6 7 8 9 22 23 24 25) (15 6 1) simpleGrading (1 1 1)
    hex (12 13 10 11 28 29 26 27) (15 6 1) simpleGrading (1 1 1)
    hex (1 2 5 14 17 18 21 30) (30 60 1) simpleGrading (1 1 1)
    hex (14 5 6 13 30 21 22 29) (30 6 1) simpleGrading (1 1 1)
    hex (13 6 9 10 29 22 25 26) (30 6 1) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (11 12 28 27)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (8 7 23 24)
        );
    }
    fixedWalls
    {
        type wall;
        faces
        (
            (0 1 17 16)
            (1 2 18 17)
            (2 3 19 18)
            (3 4 20 19)
            (4 5 21 20)
            (5 6 22 21)
            (6 7 23 22)
            (8 9 25 24)
            (9 10 26 25)
            (10 11 27 26)
            (12 13 29 28)
            (13 14 30 29)
            (14 15 31 30)
            (15 16 0 31)
        );
    }
    frontAndBack
    {
        type empty;
        faces
        (
            (0 1 14 15)
            (16 17 30 31)
            (2 3 4 5)
            (18 19 20 21)
            (6 7 8 9)
            (22 23 24 25)
            (12 13 10 11)
            (28 29 26 27)
            (1 2 5 14)
            (14 5 6 13)
            (13 6 9 10)
            (17 18 21 30)
            (30 21 22 29)
            (29 22 25 26)
        );
    }

);

// ************************************************************************* //
